Repository: Shapovalov93/R7.TaskGen
Catalog: Translation/*.po
Languages: ru

source: Enter your name, theme and press "My Variant" button
ru: Введите Ваше имя и тему, затем нажмите кнопку "Мой вариант"

source: -- Not selected --
ru: -- Не выбрана --

source: Name was entered incorrectly!
ru: Имя введено неверно!

source: Name must consists from three parts - lastname (family name), firstname and othername, separated with spaces.
ru: Имя должно состоять из трех частей - фамилии, имени и отчества, разделенных пробелами.

source: You must choose a theme!
ru: Вы должны выбрать тему!

source: You must choose a theme of work to generate variant for it.
ru: Вы должны выбрать тему работы, для которой нужно получить вариант задания.

source: Unexpected error!
ru: Неожиданная ошибка!

source: Unexpected error occured! Application restart recommended.
ru: Произошла непредвиденная ошибка! Рекомендуем перезапустить приложение.

source: No tasks for choosen theme!
ru: На выбранную тему нет задач!

source: No tasks for choosen theme found in the database
ru: К сожалению, в базе нет задач на эту тему!

source: {0} tasks choosen
ru: Выбрано {0} задач

source: Variant for: {0} {1}
ru: Вариант для: {0} {1}

source: Roman M. Yagodin - concept and programming
ru: Роман М. Ягодин - концепция и программирование

source: IconCubic <iconcubic.deviantart.com> - dices icons clipart
ru: IconCubic <iconcubic.deviantart.com> - клипарт иконок игральных костей

source: Task variants generator for use with learning courses, that uses student's name as a seed to combine randomly selected tasks in student-specific variant
ru: Генератор вариантов заданий для использования в учебных курсах, который использует имя учащегося для формирования случайно выбранных задач в специфичный для учащегося вариант задания

source: help_en.xml
ru: help_ru.xml

source: Task book: {0} {1} Task: {2}.{3}{4} {8} Complexity: {7:F1} Page: {5} {6}
ru: Задачник: {0} {1} Задача: {2}.{3}{4} {8} Сложность: {7:F1} Страница: {5} {6}

source: Task text:
ru: Текст задачи:

source: Task book: {0} {1} Task: {6} {2}{3} Complexity: {5:F1} Page: {4}
ru: Задачник: {0} {1} Задача: {6} {2}{3} Сложность: {5:F1} Страница: {4}

source: Task book: {0} {1} Task: {7} {2}{3} Complexity: {6:F1} Page: {4} {5}
ru: Задачник: {0} {1} Задача: {7} {2}{3} Сложность: {6:F1} Страница: {4} {5}

source: My Variant
ru: Мой вариант

source: Generate variant
ru: Сгенерировать вариант

source: Copy
ru: Копировать

source: Copy last variant to clipboard
ru: Копировать последний вариант в буфер обмена

source: _File
ru: _Файл

source: _Quit
ru: В_ыход

source: _Help
ru: _Справка

source: _About
ru: _О программе

source: Open _books folder...
ru: _Открыть папку с задачниками...

source: _Books
ru: Справочники

source: Full name:
ru: Полное имя:

source: Theme:
ru: Тема:

source: Open task book then button is clicked
ru: Открыть задачник при нажатии кнопки задачи
